robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_timer.c
/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author: Valentina Gaggero, Marco Accame
 * email:   valentina.gaggero@iit.it, marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/

/* @file       hal_timer.c
    @brief      This file implements internal implementation of the hal timer module.
    @author     valentina.gaggero@iit.it, marco.accame@iit.it
    @date       09/12/2011
**/

// - modules to be built: contains the HAL_USE_* macros ---------------------------------------------------------------
#include "hal_brdcfg_modules.h"

#ifdef HAL_USE_TIMER

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stdlib.h"
#include "hal_dspic_base_hid.h" 
#include "hal_brdcfg.h"
#include "hal_sys.h"
#include "hal_arch_dspic.h" 

#include <string.h>
#include <p33fxxxx.h>
#include <timer.h>  // contains specific api for the dspic timers.

 
// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "hal_timer.h"



// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 
// --------------------------------------------------------------------------------------------------------------------

#include "hal_dspic_timer_hid.h"

// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

#define HAL_timer_t2index(t)           ((uint8_t)((t)))


// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------
// emty-section

// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------

typedef struct
{
     uint16_t *timerRegAddr;
     uint16_t *timerHolRegAddr;
     uint16_t *periodRegAddr;
     uint16_t *confRegAddr; 
} hal_timer_arch_registers_t;


//this data struct rappresents register map in memory.
// x ==> even timer number
// y ==> odd timer_number.
// the timers are grouped together in two, in order to provide timer with period on 32 bits.
typedef struct
{
    uint16_t TMRx_reg;
    uint16_t TMRyHLD_reg;
    uint16_t TMRy_reg;
    uint16_t PRx_reg;
    uint16_t PRy_reg;
    uint16_t TxCON_reg;
    uint16_t TyCON_reg;
} hal_timer_arch_register_map_t;


typedef struct
{
    hal_timer_cfg_t             cfg;        // fixed for every architecture
    hal_timer_status_t          status;     // fixed for every architecture
    uint16_t                    period;
    uint16_t                    prescaler;
    hal_timer_arch_registers_t  reg;        
} hal_timer_datastructure_t;


// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_timer_supported_is(hal_timer_t timer);
static void s_hal_timer_initted_set(hal_timer_t timer);
static hal_boolval_t s_hal_timer_initted_is(hal_timer_t timer);

static void s_hal_timer_status_set(hal_timer_t timer, hal_timer_status_t status);
static hal_timer_status_t s_hal_timer_status_get(hal_timer_t timer);

static hal_result_t s_hal_timer_config(hal_timer_t timer);
static void s_hal_timer_priority_config(hal_timer_t timer);
static void s_hal_timer_callback(hal_timer_t timer);


// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------

static hal_timer_datastructure_t *s_hal_timer_info[HAL_BRDCFG_TIMER__maxnumber] = {NULL, NULL, NULL, NULL, NULL};

//size of a timers register group in PC uint = 2 byte 
static const uint8_t s_timer_arch_reg_group_size = (sizeof(hal_timer_arch_register_map_t)/2); 


// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------

extern hal_result_t hal_timer_init(hal_timer_t timer, const hal_timer_cfg_t *cfg, hal_time_t *error)
{
    hal_timer_datastructure_t *info = s_hal_timer_info[HAL_timer_t2index(timer)];
    hal_result_t res;
    uint16_t remainder;

