robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_timer.c
    if(hal_false == s_hal_timer_supported_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == info)
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cfg)
    {
        return(hal_res_NOK_nullpointer);
    }

    if(0 == cfg->countdown)
    {
        return(hal_res_NOK_wrongparam);
    }
    
    if((hal_timer_mode_oneshot == cfg->mode) && (hal_int_priorityNONE == cfg->priority))
    {
        return(hal_res_NOK_wrongparam);
    }

    if(hal_timer_prescalerAUTO == cfg->prescaler)
    {
        return(hal_res_NOK_wrongparam);
    } 

    // if running stop.
    if(hal_timer_status_running == hal_timer_status_get(timer))
    {
        hal_timer_stop(timer);
    } 
   
    
//    if(hal_timer_status_running == s_hal_timer_info[HAL_timer_t2index(timer)]->status)
//    {
//        *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) &=0x7FFF; //stop timer (reset TON bit)
//    }
//    s_hal_timer_info[HAL_timer_t2index(timer)]->status = hal_timer_status_idle;


    // marker: save the cfg and init registers

    //save configuration in working data of timer
    memcpy(&(s_hal_timer_info[HAL_timer_t2index(timer)]->cfg), cfg, sizeof(hal_timer_cfg_t));


    //config timer's registers 
    res = s_hal_timer_config(timer);
    
    if(hal_res_OK != res)
    {
        return(res); // in case the chosen prescaler is not supported
    }

    // config timer's priority and enable interrupt
    s_hal_timer_priority_config(timer);

    
    // marker: calculate error
    if(NULL != error)
    {
        remainder = (((s_hal_timer_info[HAL_timer_t2index(timer)]->cfg.countdown)*1000L)%(s_hal_timer_info[HAL_timer_t2index(timer)]->period));
        if(0 == remainder)
        {
            *error = 0;
        }
        else
        {
            *error = remainder/1000L;
        }    
    }

        
    s_hal_timer_initted_set(timer);


    return(hal_res_OK);
}


extern hal_result_t hal_timer_start(hal_timer_t timer)
{
    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if(hal_timer_status_running == s_hal_timer_status_get(timer))
    {
        hal_timer_stop(timer);
    }
    
//    if(hal_timer_status_running == s_hal_timer_info[timer]->status)
//    {
//        *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) &=0x7FFF; //stop timer
//    }
//    s_hal_timer_info[HAL_timer_t2index(timer)]->status = hal_timer_status_running;  

    s_hal_timer_status_set(timer, hal_timer_status_running);

    
    *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.timerRegAddr) = 0; //reset counting register
    *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) |= 0x8000; //set TON bit

    return(hal_res_OK);
}



extern hal_result_t hal_timer_stop(hal_timer_t timer)
{
    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if(hal_timer_status_idle == s_hal_timer_status_get(timer))
    {
        return(hal_res_OK);
    }
    
//    if(hal_timer_status_idle == s_hal_timer_info[HAL_timer_t2index(timer)]->status)
//    {
//        return(hal_res_OK);
//    }
    
    // marker: stop and set status

    *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) &=0x7FFF; //reset TON bit
//    s_hal_timer_info[HAL_timer_t2index(timer)]->status = hal_timer_status_idle;
  
    s_hal_timer_status_set(timer, hal_timer_status_idle);
  
    return(hal_res_OK);
}



extern hal_result_t hal_timer_countdown_set(hal_timer_t timer, hal_time_t countdown, hal_time_t *error)
{                                                                            
    hal_timer_cfg_t *curcfg = NULL;
    hal_timer_cfg_t newcfg;
    uint8_t wasrunning = 0;

    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    // if running stop.
    if(hal_timer_status_running == hal_timer_status_get(timer))
    {
        wasrunning = 1;
    }

    // computes the values to be put in registers
    curcfg = &s_hal_timer_info[HAL_timer_t2index(timer)]->cfg;
    memcpy(&newcfg, curcfg, sizeof(hal_timer_cfg_t));
    newcfg.countdown = countdown;

    hal_timer_init(timer, &newcfg, error);

    if(1 == wasrunning)
    {
        hal_timer_start(timer);
    }

    return(hal_res_OK);

#if 0  
    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if(hal_timer_status_running == s_hal_timer_info[timer]->status)
    {
        *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) &=0x7FFF; //stop timer (reset TON bit)
    } 


    *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.periodRegAddr) = (countdown*1000L)/s_hal_timer_info[timer]->period;
    *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.timerRegAddr) = 0; //reset counting register

    return(hal_res_OK);
#endif    
}


extern hal_result_t hal_timer_priority_set(hal_timer_t timer, hal_interrupt_priority_t prio)
{

    hal_timer_status_t actual_status;

    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if((hal_timer_mode_oneshot == s_hal_timer_info[HAL_timer_t2index(timer)]->cfg.mode) && 
       (hal_int_priorityNONE == prio) )
    {
        return(hal_res_NOK_wrongparam);
    }
    
    actual_status = s_hal_timer_info[HAL_timer_t2index(timer)]->status;

    if(hal_timer_status_running == actual_status)
    {
        *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) &=0x7FFF; //stop timer (reset TON bit)   
    }

   
    switch(timer)
    {
        case hal_timer1:
        {
            hal_sys_irqn_priority_set(hal_arch_dspic_TIM1_IRQn, prio);
        } break;
        
        case hal_timer2:
        {
            hal_sys_irqn_priority_set(hal_arch_dspic_TIM2_IRQn, prio);
        } break;
        
        case hal_timer3:
        {
            hal_sys_irqn_priority_set(hal_arch_dspic_TIM3_IRQn, prio);
        } break;
        
        case hal_timer4:
        {
            hal_sys_irqn_priority_set(hal_arch_dspic_TIM4_IRQn, prio);
        } break;
        
