robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_timer.c
        case hal_timer5:
        {
            hal_sys_irqn_priority_set(hal_arch_dspic_TIM5_IRQn, prio);
        } break;
        
        //I insert the default case, unless it never can be reached to avoid warning.
        //The default case never can be reached, because if timer is unsupperted, it is check by s_hal_timer_initted_is()
        default:
        {
            return(hal_res_NOK_generic);
        } break;
        
    }

    if(hal_timer_status_running == actual_status)
    {
        *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) |= 0x8000; //start timer (set TON bit)   
    }

    return(hal_res_OK);
}


extern hal_result_t hal_timer_interrupt_enable(hal_timer_t timer)
{
    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    switch(timer)
    {
        case hal_timer1:
        {
            hal_sys_irqn_enable(hal_arch_dspic_TIM1_IRQn);
        } break;

        case hal_timer2:
        {
            hal_sys_irqn_enable(hal_arch_dspic_TIM2_IRQn);
        } break;

        case hal_timer3:
        {
            hal_sys_irqn_enable(hal_arch_dspic_TIM3_IRQn);
        } break;
        
        case hal_timer4:
        {
            hal_sys_irqn_enable(hal_arch_dspic_TIM4_IRQn);
        } break;
        
        case hal_timer5:
        {
            hal_sys_irqn_enable(hal_arch_dspic_TIM5_IRQn);
        } break;

        //I insert the default case, unless it never can be reached to evaoid warning.
        //The default case never can be reached, because if timer is unsupperted, it is check by s_hal_timer_initted_is()
        default:
        {
            return(hal_res_NOK_generic);
        } break;
    }

    return(hal_res_OK);
}



extern hal_result_t hal_timer_interrupt_disable(hal_timer_t timer)
{
    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

        switch(timer)
    {
        case hal_timer1:
        {
            hal_sys_irqn_disable(hal_arch_dspic_TIM1_IRQn);
        } break;

        case hal_timer2:
        {
            hal_sys_irqn_disable(hal_arch_dspic_TIM2_IRQn);
        } break;

        case hal_timer3:
        {
            hal_sys_irqn_disable(hal_arch_dspic_TIM3_IRQn);
        } break;
        
        case hal_timer4:
        {
            hal_sys_irqn_disable(hal_arch_dspic_TIM4_IRQn);
        } break;

        case hal_timer5:
        {
             hal_sys_irqn_disable(hal_arch_dspic_TIM5_IRQn);
        } break;

        //I insert the default case, unless it never can be reached to evaoid warning.
        //The default case never can be reached, because if timer is unsupperted, it is check by s_hal_timer_initted_is()
        default:
        {
            return(hal_res_NOK_generic);
        } break;
    }
 

    return(hal_res_OK);
}



extern hal_result_t hal_timer_remainingtime_get(hal_timer_t timer, hal_time_t *remaining_time)
{
    /* Note: the timers in DSPIC count in ascending order. */

    uint32_t remaining_tick_num;

    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == remaining_time)
    {
        return(hal_res_NOK_generic);
    }

    remaining_tick_num =  *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.periodRegAddr) -  
                          *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.timerRegAddr);
    
    *remaining_time = ((remaining_tick_num)*(s_hal_timer_info[HAL_timer_t2index(timer)]->period)) / 1000L;
    
    return(hal_res_OK);
}


extern hal_result_t hal_timer_offset_write(hal_timer_t timer, hal_nanotime_t offset)
{
    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_res_NOK_generic);
    }

    if(offset >= s_hal_timer_info[HAL_timer_t2index(timer)]->cfg.countdown)
    {
        return(hal_res_NOK_wrongparam);
    }

    *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.timerRegAddr) = offset/s_hal_timer_info[HAL_timer_t2index(timer)]->period;  

    
    return(hal_res_OK);
}


extern hal_timer_status_t hal_timer_status_get(hal_timer_t timer)
{

    if(hal_false == s_hal_timer_initted_is(timer))
    {
        return(hal_timer_status_none);
    }

    return(s_hal_timer_status_get(timer));
}




// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------


// ---- isr of the module: begin ----

// isr for timer1
void __attribute__((interrupt, no_auto_psv)) _T1Interrupt(void)
{
    s_hal_timer_callback(hal_timer1);
    
    IFS0bits.T1IF = 0; // clear flag  
}

// isr for timer2
void __attribute__((interrupt, no_auto_psv)) _T2Interrupt(void)
{
    s_hal_timer_callback(hal_timer2);

    IFS0bits.T2IF = 0; // clear flag  
}

// isr for timer3
void __attribute__((interrupt, no_auto_psv)) _T3Interrupt(void)
{
    s_hal_timer_callback(hal_timer3);
  
    IFS0bits.T3IF = 0; // clear flag  
}

// isr for timer4
void __attribute__((interrupt, no_auto_psv)) _T4Interrupt(void)
{
    s_hal_timer_callback(hal_timer4);

    IFS1bits.T4IF = 0; // clear flag  
}

// isr for timer5
void __attribute__((interrupt, no_auto_psv)) _T5Interrupt(void)
{
    s_hal_timer_callback(hal_timer5);
  
    IFS1bits.T5IF = 0; // clear flag  
}

// ---- isr of the module: end ------


extern uint32_t hal_timer_hid_getsize(const hal_cfg_t *cfg)
{
    uint32_t size = 0;
      
    if(cfg->timers_num > HAL_BRDCFG_TIMER__maxnumber)
    {
        size = (HAL_BRDCFG_TIMER__maxnumber * sizeof(hal_timer_datastructure_t));
    }
    else
    {
        size = (cfg->timers_num * sizeof(hal_timer_datastructure_t));
    }
    return(size);   
}

extern hal_result_t hal_timer_hid_setmem(const hal_cfg_t *cfg, uint32_t *memory)
{
    uint8_t i, timers_num;
    

    if(NULL == memory)
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_missingmemory, "hal_xxx_hid_setmem(): memory missing");
        return(hal_res_NOK_generic);
    }

    if(cfg->timers_num > HAL_BRDCFG_TIMER__maxnumber)
    {
        timers_num = HAL_BRDCFG_TIMER__maxnumber;
    }
    else
    {
        timers_num = cfg->timers_num;
    }

    for(i=0; i<timers_num; i++)
    {
        s_hal_timer_info[i] = (hal_timer_datastructure_t*)memory;
        memset(s_hal_timer_info[i], 0, sizeof(hal_timer_datastructure_t));
        memory += sizeof(hal_timer_datastructure_t);
    }
    return(hal_res_OK);  
}

