robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_timer.c
// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions 
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_timer_supported_is(hal_timer_t timer)
{
    return(hal_base_hid_byte_bitcheck(hal_brdcfg_timer__supported_mask, HAL_timer_t2index(timer)) );
}

static void s_hal_timer_initted_set(hal_timer_t timer)
{
    s_hal_timer_status_set(timer, hal_timer_status_idle);
}

static hal_boolval_t s_hal_timer_initted_is(hal_timer_t timer)
{
    return((hal_timer_status_none != s_hal_timer_status_get(timer)) ? (hal_true) : (hal_false));
}

static void s_hal_timer_status_set(hal_timer_t timer, hal_timer_status_t status)
{
    s_hal_timer_info[HAL_timer_t2index(timer)]->status = status;
}

static hal_timer_status_t s_hal_timer_status_get(hal_timer_t timer)
{
    hal_timer_datastructure_t *info = s_hal_timer_info[HAL_timer_t2index(timer)];
    return( (NULL == info) ? (hal_timer_status_none) : (info->status) );
}


static hal_result_t s_hal_timer_config(hal_timer_t timer)
{
    //I used T1's macros because they are equal to other timers' macros.

    uint16_t flags = 0; 
    uint16_t *timerRegAddr, *periodRegAddr, *confRegAddr;
    uint8_t num_group_reg;
    uint8_t odd;
    hal_timer_datastructure_t *t_data_ptr = s_hal_timer_info[HAL_timer_t2index(timer)];  
    
    flags  = T1_OFF & T1_GATE_OFF & T1_IDLE_STOP & T1_SOURCE_INT;

    switch(t_data_ptr->cfg.prescaler)
    {
        case hal_timer_prescaler1:
        {
            flags &= T1_PS_1_1;
            t_data_ptr->period = 25; //expressed in nanosec
        }
        break;

        case hal_timer_prescaler8:
        {
            flags &= T1_PS_1_8;
            t_data_ptr->period = 200; //expressed in nanosec
        }
        break;


        case hal_timer_prescaler64:
        {
            flags &= T1_PS_1_64;
            t_data_ptr->period = 1600; //expressed in nanosec
        }
        break;

        case hal_timer_prescaler256:
        {
            flags &= T1_PS_1_256;
            t_data_ptr->period = 6400; //expressed in nanosec
        }
        break;

        default:
        {
            return(hal_res_NOK_unsupported);
        }
    }


    if(hal_timer1 == timer)
    {
        t_data_ptr->reg.timerRegAddr = (uint16_t *)(&TMR1);
        t_data_ptr->reg.periodRegAddr = (uint16_t *)(&PR1);
        t_data_ptr->reg.confRegAddr = (uint16_t *)(&T1CON);
        flags &= T1_SYNC_EXT_OFF;
    }
    else
    {
        
    switch(timer)
    {
        case hal_timer2:
        case hal_timer4:
        {
            odd = 0;
            num_group_reg = (HAL_timer_t2index(timer) - HAL_timer_t2index(hal_timer2))/2;
            timerRegAddr = (uint16_t *)(&TMR2 + s_timer_arch_reg_group_size *num_group_reg + odd);
        }
        break;

        case hal_timer3:
        case hal_timer5:
        {
            odd = 1;
            num_group_reg = (HAL_timer_t2index(timer) - HAL_timer_t2index(hal_timer2))/2;
            timerRegAddr = (uint16_t *)(&TMR2 + s_timer_arch_reg_group_size *num_group_reg + odd + 1); 
        }
        break;

        default:
            break;
    }

        periodRegAddr = (uint16_t *)(&PR2 + s_timer_arch_reg_group_size*num_group_reg + odd);
        confRegAddr = (uint16_t *)(&T2CON + s_timer_arch_reg_group_size*num_group_reg + odd);
        
        //save register adress in ram.
        t_data_ptr->reg.timerRegAddr = timerRegAddr;
        t_data_ptr->reg.periodRegAddr = periodRegAddr;
        t_data_ptr->reg.confRegAddr = confRegAddr;
    }

    /* config register */

    // Reset timer value to 0x0000
    *(t_data_ptr->reg.timerRegAddr) = 0; 

    // assigning Period to Timer period register
    *(t_data_ptr->reg.periodRegAddr) = ((t_data_ptr->cfg.countdown)*1000L)/t_data_ptr->period;

    // config timer's control regiter
    *(t_data_ptr->reg.confRegAddr) = 0;
    *(t_data_ptr->reg.confRegAddr) = flags;  

    //configure timer to work on 16 bits
    *(t_data_ptr->reg.confRegAddr) &= 0xFFF7; //

    return(hal_res_OK);
}  

static void s_hal_timer_priority_config(hal_timer_t timer)
{

    uint8_t int_on = hal_false;
    hal_interrupt_priority_t prio = s_hal_timer_info[HAL_timer_t2index(timer)]->cfg.priority;

    if(hal_int_priorityNONE != prio)
    {
        int_on = hal_true;
    }
    switch(timer)
    {
        case hal_timer1:
        {
            if(int_on)
            {
                hal_sys_irqn_priority_set(hal_arch_dspic_TIM1_IRQn, prio);
                hal_sys_irqn_enable(hal_arch_dspic_TIM1_IRQn);
            }
            else
            {
                hal_sys_irqn_disable(hal_arch_dspic_TIM1_IRQn);
            }
            break;
        }

        case hal_timer2:
        {
            if(int_on)
            {
                hal_sys_irqn_priority_set(hal_arch_dspic_TIM2_IRQn, prio);
                hal_sys_irqn_enable(hal_arch_dspic_TIM2_IRQn);            
            }
            else
            {
                hal_sys_irqn_disable(hal_arch_dspic_TIM2_IRQn);
            }
            break;
        }

        case hal_timer3:
        {
            if(int_on)
            {
                hal_sys_irqn_priority_set(hal_arch_dspic_TIM3_IRQn, prio);
                hal_sys_irqn_enable(hal_arch_dspic_TIM3_IRQn);
            }
            else
            {
                hal_sys_irqn_disable(hal_arch_dspic_TIM3_IRQn);
            }
            break;
        }
        case hal_timer4:
        {
            if(int_on)
            {
                hal_sys_irqn_priority_set(hal_arch_dspic_TIM4_IRQn, prio);
                hal_sys_irqn_enable(hal_arch_dspic_TIM4_IRQn);
            }
            else
            {
                hal_sys_irqn_disable(hal_arch_dspic_TIM4_IRQn);
             }
            break;
        }

        case hal_timer5:
        {
            if(int_on)
            {
                hal_sys_irqn_priority_set(hal_arch_dspic_TIM5_IRQn, prio);
                hal_sys_irqn_enable(hal_arch_dspic_TIM5_IRQn);            
            }
            else
            {
                hal_sys_irqn_disable(hal_arch_dspic_TIM5_IRQn);
             }
            break;
        }

        //I insert the default case, unless it never can be reached to evaoid warning.
        //The default case never can be reached, because if timer is unsupperted, it is check by s_hal_timer_initted_is()
        default:
        {
            return;
        } 
    } 
}


static void s_hal_timer_callback(hal_timer_t timer)
{
    hal_timer_cfg_t *cfg = &(s_hal_timer_info[HAL_timer_t2index(timer)]->cfg);
    
    if(hal_timer_mode_oneshot == cfg->mode)
    {
        *(s_hal_timer_info[HAL_timer_t2index(timer)]->reg.confRegAddr) &=0x7FFF; //stop timer (reset TON bit)       
        s_hal_timer_info[HAL_timer_t2index(timer)]->status = hal_timer_status_expired;
    }
    if(NULL != cfg->callback_on_exp)
    {
        cfg->callback_on_exp(cfg->arg);
    }
}
#endif//HAL_USE_TIMER

// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------



